test_cases/test_column_blob/constant/physicalProperties.resist
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties.resist;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

viscosityModel  constant;

// AR-P 3250, 40 % polymer
// eta = 89.93 mPa*s
// nu = 8.88e-5 m²s⁻¹
nu              [0 2 -1 0 0 0 0] 8.88e-5;
rho             [1 -3 0 0 0 0 0] 1012.3;


// ************************************************************************* //
