test_cases/test_column_blob/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;
solver          incompressibleCVoF;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         15;

deltaT          2e-4;

writeControl    adjustableRunTime;

writeInterval   1e-1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;
adjustTimeStep  no;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       1;

// ************************************************************************* //
